i18next.init({
  lng: "kz",
  resources: {
    kz: {
      translation: {
        //Navbar
        nav__title__1: "Қосымша,үйірмелер",
        nav__title__1__2: "Мүмкіндіктер",
        nav__title__2: "Нұсқаулық",
        nav__title__3: "Байланыс",
        for__center: "Орталықтар үшін",
        for__parent: "Ата-аналар үшін",
        enterence: "Жүйеге кіру",

        //header parent
        parent__header__title:
          "Балаңыздың қосымша білім алуын бүгіннен бастап қамтамасыз етіңіз!",
        parent__header__subtitle:
          "Балаңызды тегін  және ақылы қосымшалар мен үйірмелерге оқыту үшін дәл қазір өтінім тастаңыз!",
        parent__header__send: "Өтінім жіберу",
        parent__header__card_1: "Спорттық үйірмелер",
        parent__header__card_2: "Білім-ғылым қосымшалары",
        parent__header__card_3: "Робототехника",
        parent__header__card_4: "Өнер орталықтары",

        //header center
        center__header__title:
          "Мемлекеттік гранттарға қатысып, оқушыларды тегін оқытыңыз!",
        center__header__subtitle:
          "Мемлекет тарапынан оқушыларға қаржыландыру алып, үйірмелер өткізіңіз!",
        center__header__send: "Өтінім жіберу",

        //jumbatron
        jumbatron__title: "Жүйеде жеті түрлі үйірмелер бағыты бар.",
        jumbatron__subtitle: "Сіздің балаңызға ұнаған үйірмені таңдаңыз!",
        jumbatron__btn: "Үйірмені таңдау",

        //instruction
        instruction__title: "Жүйе бойынша сұрақтарыңыз болса",
        instruction__subtitle__1:
          "Жүйемен толықтай танысқыңыз келсе, бейнероликтегі нұсқаулықпен танысыңыз.",
        instruction__subtitle__2:
          "Жүйемен техникалық мәселелер туындаған жағдайда, қолдау бөліміне өтініш тастаңыз.",
        instruction__btn: "Қолдау бөліміне жазу",

        //Features
        features__title: "Жүйенің мүмкіндіктері",
        card__title__1: "Қағазбастылықты азайтады",
        card__description__1:
          "Жүйеде барлық процесстерді цифрлы түрде жүзеге асады. Құжаттар электронды түрде сақталып тұрады.",
        card__title__2: "Оқу жұмысын бағалау",
        card__description__2:
          "Электронды журналы баланың оқуын бағалауға көмектеседі. Сабақ жоспарын жүктеу арқылы оқушыларға алдағы оқытылатын тақырыптарды біле аласыз.",
        card__title__3: "Орталық филиалдарын бірегей басқару",
        card__description__3:
          "Оқу орталықтың бірнеше филиалдары бар болған жағдайда барлығын бір жүйеде басқарып, үйірмелердің өткізілуін тексеріп отыра аласыз.",
        card__title__4: "Балалардың белсенділігін қадағалау",
        card__description__4:
          "Баға қоятын журналдан бөлек оқушылардың қосымша-үйірмелерге келу/келмеуі процессін қадағалап отыратын журнал бар.",
        card__title__5: "Ата-анамен тығыз байланыс",
        card__description__5:
          "Оқушының үйірмеге қатысуы актпен бекітіледі, бұл өз кезегінде ата-ана арқылы оқушының қосымша білім алуын толықтай қамтамасыз.",
        card__title__6: "Өтінімдерді өңдеу",
        card__description__6:
          "Жүйеде өтінімдерді электронды түрде қабылдап, оларды өңдей аласыз. Өтінімдерді қарап, нәтижесін де жүйеге шығара аласыз.",

        //goverment
        goverment__main__title: "Тегін және ақылы үйірмелер",
        goverment__main__title__2: "Жеке меншік орталықтардан ақылы үйірмелер",
        goverment__card__free: "Тегін",
        goverment__card__month: "айына",
        goverment__card__btn: "Өтінім тастау",
        goverment__card__action: "Барлық үйірмелер",
        goverment__card__year: "Жас аралығы:",
        goverment__card__subyear: "жас",
        goverment__card__count: "Курстағы орындар саны:",
        goverment__card__cart__title__1: "Баскетбол үйірмесі",
        goverment__card__cart__subtitle__1: "Батыр спорт комплексі",
        goverment__card__cart__title__2: "Сольфеджио қосымшасы",
        goverment__card__cart__subtitle__2: "Орталық музыка мектебі",
        goverment__card__cart__title__3: "Робототехника үйірмесі",
        goverment__card__cart__subtitle__3: "Unicorn tech hub",
        goverment__card__cart__title__4: "Дәстүрлі би үйірмесі",
        goverment__card__cart__subtitle__4: "Орталық музыка мектебі",
        goverment__card__cart__title__5: "Web-development үйірмесі",
        goverment__card__cart__subtitle__5: "Unicorn tech hub",
        goverment__card__cart__title__6: "Футбол үйірмесі",
        goverment__card__cart__subtitle__6: "Батыр спорт комплексі",

        //hobbies
        hobbies__title: "Барлық үйірмелер",
        hobbies__all: "Барлық",
        hobbies__filter__price: "Курс бағасы бойынша",
        hobbies__filter__price__free: "Тегін",
        hobbies__filter__price__paid: "Ақылы",
        hobbies__filter__category: "Курс бағыты бойынша",

        //budget
        budget__title: "Үйірмелерге бөлінген бюджет",
        city__header__1:
          "Спорт тәртіп саласындағы аудандардың бюджеттері тәртібі",
        city__header__2:
          "Шығармашылық тәртіп саласындағы аудандардың бюджеттері",
        city__1: "Ақтау қаласы",
        city__2: "Жаңаөзен қаласы",
        city__3: "Бейнеу ауданы",
        city__4: "Қарақия ауданы",
        city__5: "Маңғыстау ауданы",
        city__6: "Мұнайлы ауданы",
        city__7: "Түпқараған ауданы",

        //faq
        faq__title: "Жиі қойылатын сұрақтар",
        accordion__title__1:
          "Әлеуметтік жағдайға байланысты жеңілдіктер бар ма?",
        accordion__description__1:
          "Жүйеде жеңілдіктер қарастырылған. Келесі әлеуметтік топтарға жататын балаларға үйірмеге қатысуға жеңілдіктер қарастырылған: жетімдер, қамқоршысынан айырылғандар, көп балалы отбасыдан шыққан балалар, мүгедектігі бар балалар",
        accordion__title__2:
          "Қосымшалар мен үйірмелер тізімін қайдан көрсем болады?",
        accordion__description__2:
          "Бастапқы беттегі навигациялық менюде көрсетілген “Қосымша,үйірмелер” сілтемесін басыңыз. Сонымен қатар, “Тегін үйірмелер”  бөлімінде “Барлық үйірмелер” батырмасын басыңыз.",
        accordion__title__3: "Жүйеге қалай тіркелсем болады?",
        accordion__description__3:
          "Жүйе тіркелуді қажет етпейді. Ата-ана ретінде жүйеге кіру үшін “Жүйеге кіру” батырмасын басып,ЭЦҚ-мен жеке кабинетке кіріңіз.",
        accordion__title__4: "Жүйеге баламды қалай тіркелемін?",
        accordion__description__4:
          "Жеке кабинетке кіріп, “Балалар” бөлімін басыңыз. Сол бетте “Баланы жүйеге қосу” батырмасын басыңыз. Формаға қажет ақпараттарды толтырыңыз.",

        //center faq
        center__accordion__title__1: "Жүйеге қалай тіркелемін?",
        center__accordion__description__1:
          "Жүйе тіркелуді қажет етпейді. Орталықтың басшысы  “Жүйеге кіру” батырмасын басады. Орталық бөлімін таңдап, “Басқарушы” рөлін таңдайды. Кіру барысында орталықтың заңды ЭЦҚ-сын қолданасыз.",
        center__accordion__title__2:
          "Мемлекеттік қосымша білім грантына қалай қатыса аламыз?",
        center__accordion__description__2:
          "Жүйеге кіріп, орталықты толықтай тіркейсіз: ғимараттың жағдайы, мұғалімдер тізімі, филиалдар мен олардың администраторлары, оқытылатын үйірмелер тізімі. Одан кейін, менюден “Конкурс жайлы хабарландырулар” бөліміне өтесіз. Білім бөлімінен жарияланған үйірмелерге арналған гранттар тізімінен өз орталығыңызға сәйкес келетінін таңдаңыз. “Өтінім жіберу” батырмасын басып, өз өтініміңізді жіберіңіз. Комиссия мүшелері сіз енгізген ақпараттарды тексеріп, өтініміңізге жауап беретін болады.",
        center__accordion__title__3:
          "Мемлекеттік грантқа оқытылған тегін үйірмелер қалай қадағаланады?",
        center__accordion__description__3:
          "Мемлекет тарапынан үйірмелерге қаражат бөлінуі үшін оқу орталықтары ата-аналармен мақұлданған актілерді ай сайын тапсырып отырады. Бұл актілерде оқушылардың қосымша сабақтарға баруы бойынша нақты ақпараттар көрсетіледі.",
        center__accordion__title__4:
          "Орталықтар арасында грант бөлу процессіне қандай факторлар әсер етеді?",
        center__accordion__description__4:
          "Грант беру процессіне келесі факторлар әсер етеді: оқушылардың әлеуметтік жағдайына қарай жеңілдіктің болуы, материалдық-техникалық базаның толықтырылуы, мұғалімдердің біліктілігі, орталық ғимаратының жағдайы.",

        //footer
        footer__paragraph: "Үйірме арқылы балалардың оқуға ынтасын арттырыңыз",
        nav__header: "Байланыс",
        nav__header__2: "Сілтемелер",
        nav__header__link__1: "Басты бет",
        nav__header__link__2: "Қосымша, үйірмелер",
        nav__header__link__3: "Орталық үшін",
      },
    },
    ru: {
      translation: {
        nav__title__1: "Приложения, кружки",
        nav__title__1__2: "Возможности",
        nav__title__2: "Инструкция",
        nav__title__3: "Связь",
        for__center: "Для центров",
        for__parent: "Для родителей",
        enterence: "Войти в систему",

        //header parent
        parent__header__title:
          "Обеспечьте ребенка дополнительным образованием уже сегодня!",
        parent__header__subtitle:
          "Подайте заявку сейчас, чтобы обучать своего ребенка в бесплатных и платных приложениях и клубах!",
        parent__header__send: "Подать заявление",
        parent__header__card_1: "Спортивные клубы",
        parent__header__card_2: "Образовательные приложения",
        parent__header__card_3: "Робототехника",
        parent__header__card_4: "Арт-центры",

        //header center
        center__header__title:
          "Участвуйте в государственных грантах и ​​обучайте студентов бесплатно!",
        center__header__subtitle:
          "Получите финансирование для студентов от государства и организуйте клубы!",
        center__header__send: "Подать заявление",

        //jumbatron
        jumbatron__title: "В системе есть семь различных круговых маршрутов.",
        jumbatron__subtitle: "Выбирайте клуб, который нравится вашему ребенку!",
        jumbatron__btn: "Выбрать клуб",

        //instruction
        instruction__title: "Если у вас есть вопросы по системе",
        instruction__subtitle__1:
          "Если вы хотите полностью ознакомиться с системой, ознакомьтесь с обучающим видео.",
        instruction__subtitle__2:
          "В случае технических проблем с системой отправьте запрос в службу поддержки.",
        instruction__btn: "Пишите в поддержку",

        //Features
        features__title: "Особенности системы",
        card__title__1: "Сокращает бумажную работу",
        card__description__1:
          "Система реализует все процессы в цифровом виде. Документы хранятся в электронном виде.",
        card__title__2: "Оценка академической работы",
        card__description__2:
          "Электронный журнал помогает оценить обучение ребенка. Скачав план урока, вы сможете узнать темы, которые будут преподаваться ученикам.",
        card__title__3: "Уникальное управление центральными филиалами",
        card__description__3:
          "Если в образовательном центре несколько филиалов, вы можете управлять ими всеми в одной системе и контролировать ведение клубов.",
        card__title__4: "Наблюдение за активностью детей",
        card__description__4:
          "Помимо журнала оценок, существует журнал, в котором отслеживается посещаемость/неявка учащихся на внеклассные занятия.",
        card__title__5: "Тесный контакт с родителями",
        card__description__5:
          "Участие учащегося в клубе утверждается актом, который в свою очередь обеспечивает дополнительное образование учащегося через родителей.",
        card__title__6: "Обработка заявок",
        card__description__6:
          "Вы можете получать и обрабатывать заявки в электронном виде в системе. Вы можете просматривать заявки и выводить результаты в систему.",

        //goverment
        goverment__main__title: "Бесплатные и платные кружки",
        goverment__card__free: "Бесплатно",
        goverment__card__month: "в месяц",
        goverment__card__btn: "Подать заявление",
        goverment__card__action: "Все кружки",
        goverment__card__year: "Возрастной диапазон:",
        goverment__card__subyear: "лет",
        goverment__card__count: "Количество мест на курсе:",
        goverment__card__cart__title__1: "Баскетбольный клуб",
        goverment__card__cart__subtitle__1: "Спортивный комплекс Батыр",
        goverment__card__cart__title__2: "Кружок по Сольфеджио",
        goverment__card__cart__subtitle__2: "Центральная музыкальная школа",
        goverment__card__cart__title__3: "Клуб робототехники",
        goverment__card__cart__subtitle__3: "Unicorn tech hub",
        goverment__card__cart__title__4: "Клуб традиционных танцев",
        goverment__card__cart__subtitle__4: "Центральная музыкальная школа",
        goverment__card__cart__title__5: "Web-development клуб",
        goverment__card__cart__subtitle__5: "Unicorn tech hub",
        goverment__card__cart__title__6: "Футбольный клуб",
        goverment__card__cart__subtitle__6: "Спортивный комплекс Батыр",

        //hobbies
        hobbies__title: "Все кружки",
        hobbies__all: "Все",
        hobbies__filter__price: "По цене курса",
        hobbies__filter__price__free: "Бесплатно",
        hobbies__filter__price__paid: "Платно",
        hobbies__filter__category: "По направлению курса",
        //budget
        budget__title: "Бюджет, выделенный клубам",
        city__header__1: "Бюджеты районов в области спортивного заказа",
        city__header__2: "Бюджеты районов в области творческого заказа",
        city__1: "город Актау",
        city__2: "город Жанаозен",
        city__3: "Бейнеуский район",
        city__4: "Каракия район",
        city__5: "Мангистауская область",
        city__6: "Нефтяной район",
        city__7: "Тупкараганский район",

        //faq
        faq__title: "Часто задаваемые вопросы",
        accordion__title__1: "Есть ли льготы из-за социального статуса?",
        accordion__description__1:
          "В системе предусмотрены скидки. Предусмотрены скидки на участие в клубе для детей, принадлежащих к следующим социальным группам: дети-сироты, потерявшие опекунов, дети из многодетных семей, дети с ограниченными возможностями.",
        accordion__title__2: "Где посмотреть список дополнительных и кружков?",
        accordion__description__2:
          "Нажмите ссылку «Приложения, кружки» в меню навигации на главной странице. Также в разделе «Бесплатные кружки» нажмите кнопку «Все кружки».",
        accordion__title__3: "Как мне зарегистрироваться?",
        accordion__description__3:
          "Система не требует регистрации. Для входа в систему в качестве родителя нажмите кнопку «Войти» и войдите в личный кабинет с ЭЦП.",
        accordion__title__4: "Как зарегистрировать ребенка в системе?",
        accordion__description__4:
          "Войдите в личный кабинет и нажмите на раздел «Детям». На левой странице нажмите кнопку «Добавить ребенка в систему». Заполните необходимую информацию в форме.",

        //center faq
        center__accordion__title__1: "Как мне зарегистрироваться?",
        center__accordion__description__1:
          "Система не требует регистрации. Руководитель центра нажимает кнопку «Войти». Выберите раздел Центральный и выберите роль «Администратор». При входе в систему вы будете использовать юридический идентификационный номер центра.",
        center__accordion__title__2:
          "Как мы можем участвовать в государственном гранте дополнительного образования?",
        center__accordion__description__2:
          "Войдите и зарегистрируйте центр полностью: статус здания, список преподавателей, филиалов и их администраторов, список обучающих кружков. После этого вы перейдете в раздел «Объявления о конкурсах» из меню. Из списка грантов для клубов, опубликованного Департаментом образования, выберите тот, который подходит для вашего центра. Нажмите кнопку «Отправить заявку» и отправьте заявку. Члены комиссии проверят введенную вами информацию и ответят на ваше заявление.",
        center__accordion__title__3:
          "Как контролируются бесплатные клубы, обученные на государственные гранты?",
        center__accordion__description__3:
          "Ежемесячно образовательные центры представляют одобренные родителями документы на выделение клубам средств государством. В этих актах содержится конкретная информация об учащихся, посещающих дополнительные занятия.",
        center__accordion__title__4:
          "Какие факторы влияют на процесс распределения грантов между центрами?",
        center__accordion__description__4:
          "На процесс предоставления грантов влияют следующие факторы: наличие скидок в зависимости от социального положения студентов, пополнение материально-технической базы, квалификация преподавателей, состояние здания центра.",

        //footer
        footer__paragraph: "Поощряйте детей учиться через клубы",
        nav__header: "Связь",
        nav__header__2: "Ссылки",
        nav__header__link__1: "Главная страница",
        nav__header__link__2: "Приложения, кружки",
        nav__header__link__3: "Для центра",
      },
    },
  },
});
